{"config": {"name": "model_1", "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 200, 200, 1]}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"padding": "valid", "pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "name": "batch_normalization_1"}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "filters": 32, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "name": "batch_normalization_2"}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_4", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "filters": 32, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "name": "add_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_3", 0, 0, {}]]]}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "name": "batch_normalization_3"}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_5", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "filters": 64, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "name": "batch_normalization_4"}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_7", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_6", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "filters": 64, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_2"}, "class_name": "Add", "name": "add_2", "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "name": "batch_normalization_5"}, "class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_8", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "filters": 128, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "name": "batch_normalization_6"}, "class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"config": {"kernel_size": [1, 1], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_10", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_regularizer": null, "filters": 128, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_9", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "filters": 128, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_3"}, "class_name": "Add", "name": "add_3", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["conv2d_9", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "use_bias": true, "activation": "linear", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "use_bias": true, "activation": "linear", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_3", "bias_constraint": null, "use_bias": true, "activation": "linear", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_4", "bias_constraint": null, "use_bias": true, "activation": "linear", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0], ["dense_4", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}