{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0], ["dense_4", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 200, 200, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 32, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [5, 5], "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [3, 3], "padding": "valid"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "strides": [2, 2], "filters": 32, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 32, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [1, 1], "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "strides": [1, 1], "filters": 32, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "strides": [2, 2], "filters": 64, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 64, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [1, 1], "kernel_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "strides": [1, 1], "filters": 64, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "strides": [2, 2], "filters": 128, "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 128, "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [1, 1], "kernel_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "strides": [1, 1], "filters": 128, "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["conv2d_9", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.5, "trainable": true}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1", "activation": "linear", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_2", "activation": "linear", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_3", "activation": "linear", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_4", "activation": "linear", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}}