{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0], ["dense_4", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 200, 200, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_1", "filters": 32, "kernel_size": [5, 5], "bias_regularizer": null, "trainable": true, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_2", "filters": 32, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_4", "filters": 32, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_3", "filters": 32, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_5", "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_7", "filters": 64, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_6", "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_5", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_8", "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_6", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "center": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_10", "filters": 128, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "conv2d_9", "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["conv2d_9", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.5, "noise_shape": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "dense_3", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "dense_4", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}}